BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega32C1.PIC
        <edc:SFRDef edc:_addr="0xE4" edc:access="-nnnnnnn" edc:cname="CANBT3" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="Sample Type" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHS1" edc:desc="Phase Segment 1 bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PHS2" edc:desc="Phase Segment 2 bits" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE5" edc:access="nnnnnnnn" edc:cname="CANTCON" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TPRSC" edc:desc="Timer Control bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CANTIM" edc:nzwidth="0x10" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CANTIM" edc:desc="CAN Timer bits" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CANTTC" edc:nzwidth="0x10" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TIMTTC" edc:desc="TTC Timer Count" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEA" edc:access="nnnnnnnn" edc:cname="CANTEC" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TEC" edc:desc="Transmit Error Counter bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEB" edc:access="nnnnnnnn" edc:cname="CANREC" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="REC" edc:desc="Receive Error Counter bits" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nnnnnnnn" edc:cname="CANHPMOB" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGP" edc:desc="CAN General Purpose bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="HPMOB" edc:desc="Highest Priority MOb Number bits" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="nnnnnnnn" edc:cname="CANPAGE" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDX" edc:desc="Data Buffer Index bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="AINC" edc:desc="MOb Data Buffer Auto Increment (Active Low)" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MOBNB" edc:desc="MOb Number bits" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnnnnnnn" edc:cname="CANSTMOB" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AERR" edc:desc="Ackknowledgement Error on MOb" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="Form Error on MOb" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CERR" edc:desc="CRC Error on MOb" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SERR" edc:desc="Stuff Error on MOb" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BERR" edc:desc="Bit Error on MOb" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOK" edc:desc="Receive OK on MOb" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXOK" edc:desc="Transmit OK on MOb" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLCW" edc:desc="Data Length Code Warning on MOb" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="nnnnnnnn" edc:cname="CANCDMOB" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC" edc:desc="Data Length Code bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="IDE" edc:desc="Identifier Extension" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPLV" edc:desc="Reply Valid" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CONMOB" edc:desc="MOb Config bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="CANIDT4" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0TAG" edc:desc="Reserved Bit 0 Tag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1TAG" edc:desc="Reserved Bit 1 Tag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTRTAG" edc:desc="Remote Transmission Request Tag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDT" edc:desc="Identifier Tag" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="CANIDT3" edc:nzwidth="0x8" ltx:memberofperipheral="CAN">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IDT" edc:desc="Identifier Tag" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
